examples/EmberPaperCases/Basic/bb_YesFenceYesHouse_16H/a_windSim/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Uinlet          (8.9408 0 0);  // 20 mph

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{

    xMin
    {
        type                    logProfileVelocityInlet;
        UfreeStream             8.9408;    // 20 mph
        uDirection              (1 0 0);
        inputWindHeight_Veg     6.095999805;    // 20 ft
        z0                      0.01;
        Rd                      0;
        firstCellHeight         0.9144;  // dz. 3 ft
    }
    xMax
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
	yMin
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
	yMax
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
	zMax
    {
        type            zeroGradient;
    }

    ground
    {
		type            fixedValue;
        value           uniform (0 0 0);
    }
    
    
    cube
    {
        //type            noSlip;
		type            fixedValue;
        value           uniform (0 0 0);
    }

}

// ************************************************************************* //
