examples/EmberPaperCases/Basic/bb_YesFenceYesHouse_16H/a_windSim/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     myDragSimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1252;

deltaT          1;

writeControl    timeStep;

writeInterval   250;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;



libs
(
    "libWindNinja.so"
    "libmyWindNinjaDragkEpsilon.so"
);


functions
{
    #includeFunc  residuals
}




// ************************************************************************* //
